Revit 2015 API
DefaultDivideSettings.SetDistance Method
 Sets the default Divided Surface distance for a fixed, minimum, or maximum distance layout for U or V gridlines. This method is obsolete in Revit 2015. Use setSurfaceDistance instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute]
public void SetDistance(
	UVGridlineType gridlines,
	double distance
)
Visual Basic
<ObsoleteAttribute> _
Public Sub SetDistance ( _
	gridlines As UVGridlineType, _
	distance As Double _
)
Visual C++
[ObsoleteAttribute]
public:
void SetDistance(
	UVGridlineType gridlines,
	double distance
)
Parameters
gridlines
Type: Autodesk.Revit.DB.UVGridlineType
 U-gridlines or V-gridlines.
distance
Type: System.Double
 A default distance for a layout.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given value for distance must be positive. -or- A value passed for an enumeration argument is not a member of that enumeration
See Also
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace